rails/rails_actioncable_demo/app/controllers/homes_controller.rb

SELECT  "homes".* FROM "homes" WHERE "homes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    puts "**** homescontroller show"
    @home = Home.find(1)

SELECT  "homes".* FROM "homes" WHERE "homes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "homes" SET "message" = $1, "updated_at" = $2 WHERE "homes"."id" = $3  [["message", nil], ["updated_at", 2017-03-24 13:00:45 UTC], ["id", 1]]
---
  def update
    message = params[:home][:message]
    puts "******* homecontroller store - #{message}"
    @home = Home.find(1)
    @home.message = message
    if @home.save