rails/chatter/app/controllers/posts_controller.rb

  def create
    post = Post.create(post_params)
---
INSERT INTO "posts" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", "Test!"], ["created_at", "2021-11-18 18:38:38.229660"], ["updated_at", "2021-11-18 18:38:38.229660"]]